In [62]:
import os
import pandas as pd
import numpy as np

In [63]:
df = pd.read_csv(os.path.join('.data', 'train.csv'))
print(df.shape)
df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [64]:
df['Age'] = df['Age'].fillna(value=-1)
df['Age'] = round(df['Age']).astype('int64')
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age              int64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [94]:
for el in list(set(df.columns.to_list()).difference({'PassengerId', 'Ticket', 'Name'})):
    print(el)
    print('NA: ', df[el].isnull().sum())
    print(df[el].value_counts())
    print()

Pclass
NA:  0
3    491
1    216
2    184
Name: Pclass, dtype: int64

Parch
NA:  0
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

Sex
NA:  0
male      577
female    314
Name: Sex, dtype: int64

Cabin
NA:  687
B96 B98        4
G6             4
C23 C25 C27    4
F2             3
F33            3
              ..
A19            1
D7             1
C101           1
A34            1
E31            1
Name: Cabin, Length: 147, dtype: int64

SibSp
NA:  0
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

Fare
NA:  0
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

Survived
NA:  0
0    549
1    342
Name: Survived, dtype: int64

Embarked
NA:  2
S    644
C    168
Q     77
Name: Embarked, dtype: int64

Age
NA:  0
-1     177
 24     32
 22     27
 28     27
 30     27
      ...
 0       1
 66      1
 74      1
 53      1
 80      1
Name: Age, Length: 72, dtype: int64